// 商机状态列表 关闭(-10), 跟进(10), 成交(100)
export const businessStatus = new Map([
  [-10, '关闭'],
  [10, '跟进'],
  [100, '成交']
])

// 意向【租赁，购买】
export const intentionsList = new Map([
  ['租赁', '租赁'],
  ['购买', '购买']
])

// 来源【官网注册，朋友推荐，客户推荐，客户咨询】
export const sourcesList = new Map([
  ['渠道中介', '渠道中介'],
  ['自主拓客', '自主拓客'],
  ['朋友介绍', '朋友介绍'],
  ['领导推荐', '领导推荐'],
  ['同事推荐', '同事推荐'],
  ['园区活动', '园区活动'],
  // ['网站信息', '网站信息'],
  ['电销客户', '电销客户'],
  ['其它渠道', '其它渠道']
])

// 客户类别【A,B,C】
export const customerCateList = new Map([
  ['A', 'A'],
  ['B', 'B'],
  ['C', 'C'],
  ['D', 'D'],
  ['E', 'E']
])

// 沟通方式
export const communicationList = [
  ['电话呼入', '电话呼入'],
  ['电询客户', '电询客户'],
  ['微信沟通', '微信沟通'],
  ['邮件沟通', '邮件沟通'],
  ['短信沟通', '短信沟通'],
  ['上门拜访', '上门拜访'],
  ['客户上门', '客户上门'],
  ['其它方式', '其它方式']
]

// 变更类型
export const OperationPlanTypes = new Map([
  ['新增', '新增'],
  ['编辑', '编辑'],
  ['转商机', '转商机']
])

//  线索(0), 商机(10), 首看(20), 复看(30), 待定(40), 签约(90), 成交(100);

export const threadStageList = [
  { value: '0', label: '未转商机' },
  // { value: '10,20,30,40,90,100', label: '已转商机' }
  { value: '10,20,30,40,90', label: '已转商机' }
]

export const opportunityStageList = [
  // { label: '未看', value: 10 },
  { label: '首看', value: 20 },
  { label: '复看', value: 30 },
  { label: '意向', value: 40 },
  // { label: '签约', value: 90 },
  { label: '成交', value: 90 }
]

export const changeOpportunityStageList = [
  { label: '首看', value: 20 },
  { label: '复看', value: 30 },
  { label: '意向', value: 40 }
]

// 所属行业：
export const industryList = new Map([
  // ['农、林、牧、渔业', '农、林、牧、渔业'],
  // ['采矿业', '采矿业'],
  // ['制造业', '制造业'],
  // ['电力、热力、燃气及水生产和供应业', '电力、热力、燃气及水生产和供应业'],
  // ['建筑业', '建筑业'],
  // ['批发和零售业', '批发和零售业'],
  // ['交通运输、仓储和邮政业', '交通运输、仓储和邮政业'],
  // ['住宿和餐饮业', '住宿和餐饮业'],
  // ['信息传输、软件和信息技术服务业', '信息传输、软件和信息技术服务业'],
  // ['金融业', '金融业'],
  // ['房地产业', '房地产业'],
  // ['租赁和商务服务业', '租赁和商务服务业'],
  // ['科学研究和技术服务业', '科学研究和技术服务业'],
  // ['水利、环境和公共设施管理业', '水利、环境和公共设施管理业'],
  // ['居民服务、修理和其它服务业', '居民服务、修理和其它服务业'],
  // ['教育', '教育'],
  // ['卫生和社会工作', '卫生和社会工作'],
  // ['文化、体育和娱乐业', '文化、体育和娱乐业'],
  // ['公共管理、社会保障和社会组织', '公共管理、社会保障和社会组织'],
  // ['国际组织', '国际组织']
  ['互联网/AI', '互联网/AI'],
  ['计算机/电子/通信', '计算机/电子/通信'],
  ['制药/医疗', '制药/医疗'],
  ['能源/化工/环保', '能源/化工/环保'],
  ['交通/物流', '交通/物流'],
  ['机械/制造', '机械/制造'],
  ['房地产/建筑', '房地产/建筑'],
  ['广告/传媒', '广告/传媒'],
  ['文化/体育', '文化/体育'],
  ['咨询/专业服务', '咨询/专业服务'],
  ['教育/培训', '教育/培训'],
  ['金融', '金融'],
  ['汽车', '汽车'],
  ['消费品', '消费品'],
  ['餐饮/家政/娱乐服务', '餐饮/家政/娱乐服务'],
  ['政府/非盈利机构/其它', '政府/非盈利机构/其它'],

  ['专业服务', '专业服务'],
  ['信息技术', '信息技术'],
  ['技术开发', '技术开发'],
  ['教育科研', '教育科研'],
  ['科技金融', '科技金融'],
  ['商务贸易', '商务贸易'],
  ['生物医药', '生物医药'],
  ['健康咨询', '健康咨询'],
  ['文化传播', '文化传播']
])

export enum opportunityStageEnum {
  NOT = 10,
  FIRST = 20,
  SECOND = 30,
  PENDING = 40,
  // SIGN = 90,
  DEAL = 90
}
