/**
 * 意向单状态 待提交(0),待审核(10),已驳回(11),已生效(100),已成交(101),已取消(-10),已到期(-20);
 */
export const intentionStatus = new Map([
  [0, '待提交'],
  [10, '待审核'],
  [11, '已驳回'],
  [100, '已生效'],
  [101, '已成交'],
  [-10, '已取消'],
  [-20, '已到期']
])

/**
 * 意向类型 10 - 租赁意向 11 - 租赁定金 20 - 销售意向 21 - 销售定金
 */
export const intentionType = new Map([
  [10, '租赁意向'],
  [11, '租赁定金']
  // [20, '销售意向'],
  // [21, '销售定金']
])

/**
 * 意向租期单位 年、月、日
 */
export const intentionRentDurationUnit = new Map([
  ['年', '年'],
  ['月', '月'],
  ['日', '日']
])

/**
 * 租金单价单位 元/㎡/日、元/㎡/月、元/日、元/月、元/年
 */
export const intentionAmountUnit = new Map([
  ['元/㎡/日', '元/㎡/日'],
  ['元/㎡/月', '元/㎡/月'],
  ['元/日', '元/日'],
  ['元/月', '元/月'],
  ['元/年', '元/年']
])

/**
 * 物业费单价单位 元/㎡/月
 */
export const intentionAmountUnitWuye = new Map([['元/㎡/月', '元/㎡/月']])
