// 物业合同状态
// export const pmContractStatusDict = new Map([
//   [0, '未提交'],
//   [3, '已驳回'], //
//   [1, '审核中'],
//   [2, '生效中'], // 已生效
//   [8, '变更中'], // 变更审核中
//   [9, '续约中'], // 续约审核中
//   [11, '终止中'], // 终止审核中
//   [10, '已续约'],
//   [12, '已终止']
//   // [4, '退租审核中'],
//   // [5, '已退租'],
//   // [6, '作废审核中'],
//   // [7, '已作废'],
// ])

export const pmContractStatusDict = new Map([
  [0, '未提交'],
  [1, '已驳回'], //
  [2, '审核中'],
  [3, '变更中'], // 变更审核中
  [4, '续约中'], // 续约审核中
  // [5, '退租审核中'], // 退租审核中
  [6, '终止中'], // 退租审核中
  // [7, '作废审核中'], // 作废审核中
  [8, '生效中'], // 已生效
  [9, '已续约'], //
  [10, '已退租'], //
  [11, '已终止'] //
  // [12, '已作废'] //
])

// 物业合同费用单位
export const pmContractFeeUnitDict = new Map([
  [1, '元/天/㎡'],
  [2, '元/月/㎡'],
  [3, '元/年/㎡'],
  [4, '元/天'],
  [5, '元/月'],
  [6, '元/年']
])
